In [1]:
import pandas as pd

In [17]:
df = pd.DataFrame({
    '미국': [2.1, 2.2, 2.3],
    '한국': [0.4, 0.5, 0.45],
    '중국': [10, 13, 15]
},
 index = [2000, 2010, 2020]
)

df

       미국    한국  중국
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [8]:
# 컬럼과 데이터 추가하기
df['일본'] = [1, 2, 3]

df

    미국    한국  중국  일본
0  2.1  0.40  10   1
1  2.2  0.50  13   2
2  2.3  0.45  15   3

In [9]:
# 컬럼 삭제
del df['일본']

df

    미국    한국  중국
0  2.1  0.40  10
1  2.2  0.50  13
2  2.3  0.45  15

In [18]:
# 행 데이터 추가
df.loc[2021] = [3, 3, 3]

df

# df.iloc[0] = [3, 3, 3] 
# iloc 으로 하는 경우 존재하는 인덱스에 대해서 수정이 가능한데 없는 인덱스 번호를 넣으면 에러난다
# 즉, iloc으로는 추가가 안되는 듯

       미국    한국  중국
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15
2021  3.0  3.00   3

In [21]:
# 행 삭제 
df.drop([2021])

       미국    한국  중국
2000  2.1  0.40  10
2010  2.2  0.50  13
2020  2.3  0.45  15

In [23]:
# 데이터 복제
df2 = df[['중국', '한국']].copy()
df2

      중국    한국
2000  10  0.40
2010  13  0.50
2020  15  0.45
2021   3  3.00